tutorials/pM4F-Benchmarks/plot/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3600;

deltaT          1; //0.5; //5e-3; //5e-2;

writeControl    runTime;

writeInterval   60;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6

runTimeModifiable true;

maxCo 0.75; // Or other Courant number you wish

adjustTimeStep no; // Or no

maxDeltaT 0.005; //0.1; // Maximum deltaT in seconds


// ************************************************************************* //

