tutorials/pM4F-Benchmarks/plot/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       16192;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       16256;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          16384;
        startFace       16320;
    }
    bottom
    {
        type            walls;
        nFaces          128;
        startFace       32704;
    }
    top
    {
        type            walls;
        nFaces          128;
        startFace       32832;
    }
)

// ************************************************************************* //
